# Staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/customer-api/infrastructure/workspaces/staging relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/Connectilly/customer-api-staging/runs/run-P5ogsrhdTb9bLU8d

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.aws_lambda.data.archive_file.default: Refreshing...
module.aws_lambda.data.aws_iam_policy_document.default: Refreshing...
module.aws_lambda.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/customer-api-customer-api-staging]
module.aws_api_gateway.aws_apigatewayv2_api.default: Refreshing state... [id=6efdf24jn7]
module.aws_lambda.data.aws_iam_policy_document.default: Refresh complete after 0s [id=3693445097]
module.aws_lambda.aws_iam_role.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging]
module.aws_lambda.aws_iam_role_policy_attachment.default: Refreshing state... [id=lambda-execution-customer-api-customer-api-staging-20230423052105664100000001]
module.aws_lambda.data.archive_file.default: Refresh complete after 1s [id=edfc614b91aa2a91f66b53a85a54315efb08e245]
module.aws_api_gateway.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/api_gateway/customer-api-customer-api-staging]
module.aws_lambda.aws_lambda_function.default: Refreshing state... [id=customer-api-customer-api-staging]
module.aws_api_gateway.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.aws_api_gateway.aws_lambda_permission.default: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.aws_api_gateway.aws_apigatewayv2_integration.default: Refreshing state... [id=spdcay8]
module.aws_api_gateway.aws_apigatewayv2_route.any: Refreshing state... [id=xftcak4]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws_api_gateway.aws_apigatewayv2_api.default will be updated in-place
  ~ resource "aws_apigatewayv2_api" "default" {
        id                           = "6efdf24jn7"
      ~ name                         = "customer-api-customer-api-staging" -> "api-gateway-customer-api-staging-customer-api"
        tags                         = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.aws_api_gateway.aws_apigatewayv2_integration.default will be updated in-place
  ~ resource "aws_apigatewayv2_integration" "default" {
        id                     = "spdcay8"
      ~ integration_uri        = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging/invocations" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.aws_api_gateway.aws_apigatewayv2_stage.default will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "default" {
        id              = "$default"
        name            = "$default"
        tags            = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (8 unchanged attributes hidden)

      ~ access_log_settings {
          ~ destination_arn = "arn:aws:logs:ap-southeast-2:514472330244:log-group:/aws/api_gateway/customer-api-customer-api-staging" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.aws_api_gateway.aws_cloudwatch_log_group.default must be replaced
-/+ resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:ap-southeast-2:514472330244:log-group:/aws/api_gateway/customer-api-customer-api-staging" -> (known after apply)
      ~ id                = "/aws/api_gateway/customer-api-customer-api-staging" -> (known after apply)
      ~ name              = "/aws/api_gateway/customer-api-customer-api-staging" -> "/aws/api_gateway/api-gateway-customer-api-staging-customer-api" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "api_gateway"
        }
        # (3 unchanged attributes hidden)
    }

  # module.aws_api_gateway.aws_lambda_permission.default must be replaced
-/+ resource "aws_lambda_permission" "default" {
      ~ function_name       = "customer-api-customer-api-staging" -> "lambda-customer-api-staging-customer-api" # forces replacement
      ~ id                  = "AllowExecutionFromAPIGateway" -> (known after apply)
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.aws_lambda.aws_cloudwatch_log_group.default must be replaced
-/+ resource "aws_cloudwatch_log_group" "default" {
      ~ arn               = "arn:aws:logs:ap-southeast-2:514472330244:log-group:/aws/lambda/customer-api-customer-api-staging" -> (known after apply)
      ~ id                = "/aws/lambda/customer-api-customer-api-staging" -> (known after apply)
      ~ name              = "/aws/lambda/customer-api-customer-api-staging" -> "/aws/lambda/lambda-customer-api-staging-customer-api" # forces replacement
      + name_prefix       = (known after apply)
        tags              = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
        # (3 unchanged attributes hidden)
    }

  # module.aws_lambda.aws_lambda_function.default must be replaced
-/+ resource "aws_lambda_function" "default" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging" -> (known after apply)
      ~ function_name                  = "customer-api-customer-api-staging" -> "lambda-customer-api-staging-customer-api" # forces replacement
      ~ id                             = "customer-api-customer-api-staging" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging/invocations" -> (known after apply)
      ~ last_modified                  = "2023-04-23T05:21:23.261+0000" -> (known after apply)
      - layers                         = [] -> null
      ~ qualified_arn                  = "arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-2:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-2:514472330244:function:customer-api-customer-api-staging:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 18750761 -> (known after apply)
        tags                           = {
            "domain"        = "customer"
            "environment"   = "customer-api-staging"
            "resource"      = "customer-api"
            "resource_type" = "lambda"
        }
      ~ version                        = "$LATEST" -> (known after apply)
        # (12 unchanged attributes hidden)

      - ephemeral_storage {
          - size = 512 -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

Plan: 4 to add, 3 to change, 4 to destroy.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*